<a href="https://colab.research.google.com/github/syamkumarmuvvala/ML-Assignments/blob/master/Data_Cleaning_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Cleaning Assignment Pandas

### Author : Syam Kumar Muvvala

#### Loading the data frame with the one given in the assignment

In [0]:
import pandas as pd
import numpy as np
import math

In [0]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [275]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### Question - 01

**Making the FlightNumber column as an integer column and filling up the data**

In [0]:
# getting a copy of flight number column
fn = df['FlightNumber'].copy()

In [277]:
# setting the NaN values
for i in range(len(fn)):
  if math.isnan(fn[i]):
    fn[i] = 10 + fn[i-1] if i != 0 else fn[i]
fn

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [0]:
fn = fn.astype(int)
#Replacing the FlightNumber column
df['FlightNumber'] = fn

In [279]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [280]:
df.dtypes['FlightNumber']

dtype('int64')

### Question - 02 and Question - 03

Form a temporary dataframe with two columns From and To and capitalize each item

In [0]:
FromTo = df['From_To']

In [282]:
From_To = {"From" : [i.split('_')[0].title() for i in FromTo], 'To': [i.split('_')[1].title() for i in FromTo]}
From_To

{'From': ['London', 'Madrid', 'London', 'Budapest', 'Brussels'],
 'To': ['Paris', 'Milan', 'Stockholm', 'Paris', 'London']}

In [283]:
Temp = pd.DataFrame(data = From_To)
Temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

### Question - 04

Delete the FromTo column from original dataframe. Attach Temporary DataFrame to the original DataFrame

In [284]:
df.drop('From_To',axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [285]:
df = pd.concat([df,Temp],axis=1)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

### Question - 05

Delays column formation and adding the delay1 and delay2 columns to the original data frame. Removing the RecentDelays Dataframe

In [286]:
Delays = pd.DataFrame({'delay_1' : [i[0] if len(i)>0 else np.nan for i in df['RecentDelays']] ,
 'delay_2' : [i[1] if len(i)>1 else np.nan for i in df['RecentDelays']]})
Delays

   delay_1  delay_2
0     23.0     47.0
1      NaN      NaN
2     24.0     43.0
3     13.0      NaN
4     67.0     32.0

In [287]:
df.drop('RecentDelays',axis=1,inplace=True)
df = pd.concat([df,Delays],axis=1)
ColumnsList = df.columns.to_list()
CL = ColumnsList[0:1] + ColumnsList[4:] + ColumnsList[1:4]
df[CL]

   FlightNumber  delay_1  delay_2              Airline      From         To
0         10045     23.0     47.0               KLM(!)    London      Paris
1         10055      NaN      NaN    <Air France> (12)    Madrid      Milan
2         10065     24.0     43.0  (British Airways. )    London  Stockholm
3         10075     13.0      NaN       12. Air France  Budapest      Paris
4         10085     67.0     32.0          "Swiss Air"  Brussels     London